import 'package:flutter/material.dart';
import '../widgets/image_card.dart';

class HomePage extends StatelessWidget {
  const HomePage({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: const Text('65064435 สมภพ เอี่ยมสมบัติ'),
        backgroundColor: Colors.deepPurple,
        foregroundColor: Colors.white,
      ),
      body: Container(
        color: Colors.grey[100],
        child: SingleChildScrollView(
          child: Padding(
            padding: const EdgeInsets.all(16.0),
            child: SizedBox(
              height: MediaQuery.of(context).size.height * 0.8,
              child: ListView(
                children: [
                  Center(
                    child: Text('แนะนำสถานที่ท่องเที่ยว', style: TextStyle(fontSize: 24)),
                  ),
                  SizedBox(height: 32),
                  ImageCard(
                    imageUrl: 'https://dimg04.c-ctrip.com/images/0M7211200090gbc5cDDA6.png_.webp',
                    title: 'ตลาดน้ำคลองลัดมะยม, กรุงเทพฯ',
                    description: 'ตลาดน้ำคลองมะรงเป็นตลาดน้ำในเขตชานเมืองของกรุงเทพฯ ประเทศไทย ตลาดน้ำในประเทศไทยเป็นหนึ่งในสถานที่ท่องเที่ยวที่ไม่ควรพลาดในประเทศไทย ในกรณีที่วันเดินทางจำกัด หากคุณต้องการไปตลาดน้ำในตอนเช้า ไปช้อปปิ้งในห้างสรรพสินค้าใจกลางเมืองกรุงเทพในตอนบ่ายหรือกลับเข้าตัวเมืองกรุงเทพฯ แล้วตลาดน้ำคลองมะรงจะเป็นตลาดน้ำ ทางเลือกที่ดี!',
                  ),
                  ImageCard(
                    imageUrl: 'https://dimg04.c-ctrip.com/images/0M764120008ytr9hz2405.png_.webp',
                    title: 'วัดพระศรีรัตนศาสดาราม, กรุงเทพฯ',
                    description: 'วัดพระศรีรัตนศาสดาราม หรือ วัดพระแก้ว เป็นชื่อเล่นที่คนไทยส่วนใหญ่มักเรียกกัน ถือเป็นสถานที่ท่องเที่ยวชั้นนำ ประเทศที่ทั้งชาวไทยและชาวต่างชาติมาเยี่ยมชมศิลปะไทย ไม่เพียงแต่จะต้องถวายเครื่องสักการะพระหยกเท่านั้น แต่ยังต้องสวดมนต์เพื่อตนเองและกลายเป็นแหล่งท่องเที่ยวสำคัญที่วัดพระศรีรัตนศาสดารามและเป็นสถานที่ประกอบพิธีทางศาสนาที่สำคัญสำหรับชาวไทย ราชวงศ์ ภายในพระอุโบสถและระเบียงมีภาพจิตรกรรมฝาผนังเรื่องรามายณะที่สวยงาม',
                  ),
                  ImageCard(
                    imageUrl: 'https://dimg04.c-ctrip.com/images/0M717120008yu77e74BCB.png_.webp',
                    title: 'พระบรมมหาราชวัง,กรุงเทพฯ',
                    description: 'พระบรมมหาราชวังเป็นสถานที่ท่องเที่ยวที่สำคัญมากสำหรับคนไทย ด้วยความงามที่เปิดประตูต้อนรับนักท่องเที่ยวต่างชาติจำนวนมากทุกปี เคยเป็นที่ประทับของพระมหากษัตริย์ในสมัยกรุงรัตนโกสินทร์ ตั้งแต่สมัยรัชกาลที่ 1 จนถึงรัชกาลที่ 5 ปัจจุบันยังคงเป็นสถานที่ประกอบพระราชพิธีสำคัญต่างๆ แบ่งพื้นที่เป็นวัดพระศรีรัตนศาสดาราม (วัดพระแก้ว) และบริเวณราชสำนักที่ประทับของกษัตริย์และสถานที่ทำงานเพื่อเน้นความสุภาพ ไม่อนุญาตให้ใส่กางเกงขาสั้นหรือรองเท้าแตะ แต่นักท่องเที่ยวสามารถเช่ากระโปรงเพื่อสวมใส่ได้ การเดินทางสะดวกมาก นั่งเรือเจ้าพระยาจากสถานีสะพานตากสินมาลงที่ท่าเตียนมองเห็นทัศนียภาพที่สวยงามสองฝั่งแม่น้ำเจ้าพระยา รอบพระบรมมหาราชวังมีสถานที่ท่องเที่ยวสำคัญมากมาย เช่น วัดอรุณ หรือ วัดพระเชตุพนวิมลมังคลารามราชวรวิหาร (วัดพระนอน)',
                  ),
                  ImageCard(
                    imageUrl: 'https://dimg04.c-ctrip.com/images/0M747120008yvsd8f43F9.png_.webp',
                    title: 'วัดอรุณ (วัดอรุณ),กรุงเทพฯ',
                    description: 'วัดอรุณราชวรารามราชวรมหาวิหาร ชื่อทางการที่คนไทยส่วนใหญ่อาจไม่คุ้นหู แต่หากพูดถึงวัดอรุณละก็ รับรองไม่มีใครไม่รู้จัก วันอรุณเป็นอีกหนึ่งสถานที่ท่องเที่ยวยอดนิยม ตั้งอยู่ริมน้ำเจ้าพระยา โดยมีพระปรางเจดีย์ขนาดใหญ่สีขาวเป็นจุดสังเกต คนไทยและต่างชาตินิยมมาเยี่ยมชมและสักการะบูชา การเดินทางมาก็ง่าย เพียงนั่งเรือเจ้าพระยาจากท่าสะพานตากสินไปลงที่ท่าเตียน แล้วค่อยนั่งเรือข้ามฝากมาฝั่งวัดอรุณ หรือคุณอาจจะเลือกอยู่ฝั่งท่าเตียน เนื่องจากมีโรงแรม ร้านอาหาร และบาร์รูฟท็อปริมน้ำมากมาย เหมาะสำหรับการเช็คอินพักผ่อน สั่งอาหาร จิบเครื่องดื่มนั่งดูวิวสวยๆ ของวัดอรุณในตอนเย็น',
                  ),
                ],
              ),
            ),
          ),
        ),
      ),
    );
  }
}